def lat_to_cir(tekst):
    mapa = {
        'nj': 'њ', 'dž': 'џ', 'lj': 'љ',
        'NJ': 'Њ', 'DŽ': 'Џ', 'LJ': 'Љ',
        'Nj': 'Њ', 'Dž': 'Џ', 'Lj': 'Љ',
        'nJ': 'Њ', 'dŽ': 'Џ', 'lJ': 'Љ',
        'a': 'а', 'b': 'б', 'v': 'в', 'g': 'г', 'd': 'д', 'đ': 'ђ',
        'e': 'е', 'ž': 'ж', 'z': 'з', 'i': 'и', 'j': 'ј', 'k': 'к',
        'l': 'л', 'm': 'м', 'n': 'н', 'o': 'о', 'p': 'п', 'r': 'р',
        's': 'с', 't': 'т', 'ć': 'ћ', 'u': 'у', 'f': 'ф', 'h': 'х',
        'c': 'ц', 'č': 'ч', 'š': 'ш',
        'A': 'А', 'B': 'Б', 'V': 'В', 'G': 'Г', 'D': 'Д', 'Đ': 'Ђ',
        'E': 'Е', 'Ž': 'Ж', 'Z': 'З', 'I': 'И', 'J': 'Ј', 'K': 'К',
        'L': 'Л', 'M': 'М', 'N': 'Н', 'O': 'О', 'P': 'П', 'R': 'Р',
        'S': 'С', 'T': 'Т', 'Ć': 'Ћ', 'U': 'У', 'F': 'Ф', 'H': 'Х',
        'C': 'Ц', 'Č': 'Ч', 'Š': 'Ш'
    }

    for lat, cir in [('nj', 'њ'), ('dž', 'џ'), ('lj', 'љ'),
                     ('NJ', 'Њ'), ('DŽ', 'Џ'), ('LJ', 'Љ'),
                     ('Nj', 'Њ'), ('Dž', 'Џ'), ('Lj', 'Љ'),
                     ('nJ', 'Њ'), ('dŽ', 'Џ'), ('lJ', 'Љ')]:
        tekst = tekst.replace(lat,cir)

    return ''.join(mapa.get(c,c) for c in tekst)


def cir_to_lat_osisano(tekst):
    mapa = {
        'њ': 'nj', 'џ': 'dz', 'љ': 'lj',
        'Њ': 'Nj', 'Џ': 'Dz', 'Љ': 'Lj',
        'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'ђ': 'd',
        'е': 'e', 'ж': 'z', 'з': 'z', 'и': 'i', 'ј': 'j', 'к': 'k',
        'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r',
        'с': 's', 'т': 't', 'ћ': 'c', 'у': 'u', 'ф': 'f', 'х': 'h',
        'ц': 'c', 'ч': 'c', 'ш': 's',
        'А': 'A', 'Б': 'B', 'В': 'V', 'Г': 'G', 'Д': 'D', 'Ђ': 'D',
        'Е': 'E', 'Ж': 'Z', 'З': 'Z', 'И': 'I', 'Ј': 'J', 'К': 'K',
        'Л': 'L', 'М': 'M', 'Н': 'N', 'О': 'O', 'П': 'P', 'Р': 'R',
        'С': 'S', 'Т': 'T', 'Ћ': 'C', 'У': 'U', 'Ф': 'F', 'Х': 'H',
        'Ц': 'C', 'Ч': 'C', 'Ш': 'S'
    }

    for cir, lat in [('њ', 'nj'), ('џ', 'dz'), ('љ', 'lj'),
                     ('Њ', 'Nj'), ('Џ', 'Dz'), ('Љ', 'Lj')]:
        tekst = tekst.replace(lat,cir)

    return ''.join(mapa.get(c,c) for c in tekst)


def formatiraj_datum(dt):
    #return f"{dt.day}.{'{:02d}'.format(dt.month)}.{dt.year}."
    return f"{dt.day}.{dt.month}.{dt.year}."
    #return 'Error: To be implemented.'